#include <stdio.h>

int main(void) {
    // Цикл for (ВСЁ ДЛЯ ТЕБЯ РАССВЕТЫ И ТУМАНЫ ДЛЯ ТЕБЯ ЦВЕТОЧНЫЕ ПОЛЯНЫ ДЛЯЯЯЯЯЯЯЯ ТЕБЯЯЯЯЯ)
    for (int i = 0; i < 5; i++) {
        printf("Step: %d\n", i);
    }

    // Цикл while (да пока пока..))
    int a = 7;
    while (a != 0) {
        a--;
        printf("A: %d\n", a);
    }

    // do..while выполняется один раз гарантированно, после проверяет условие, пока условие истинно выполняется
    int b = 4;
    do
    {
        printf("meow :3\n");
    }
    while (b > 4);

    // В циклах также по базе доступны ключевые слова continue и break

    return 0;
}
