#include <stdio.h>

/*
Определение функции
возвращаемый_тип название_функции(аргументы) {тело функции}
*/

void hello() {
    printf("hello\n");
}

void helloWithArgs(int age, char name[]) {
    printf("Name: %s\nAge:%d\n", name, age);
}


/*
Функция main() точка входа в наш код, отсюда он начинает выполняться (ОГО ВОТ ЭТО ДА!) (Подробнее тут интересненько: https://ru.wikipedia.org/wiki/%D0%A2%D0%BE%D1%87%D0%BA%D0%B0_%D0%B2%D1%85%D0%BE%D0%B4%D0%B0)
Функция main по спецификации обязана возвращать int
Никто не запрещает использовать void main(), но данная запись является нестандартной и имеет непредсказуемое поведение.
*/
int main(void) { // void явно указывает компилятору, что функция не принимает аргументы, можно писать и без void, но зависит от версии спецификации и компилятора.
    hello(); // Вызываем функцию hello (вау первая функция как и первый цикл легендарна)

    int age = 30;
    char name[] = "Jesica";
    helloWithArgs(age, name);

    return 0; // Выход с кодом 0 (программа завершена без ошибок, упал вставай, встал упай, упай чокопай)
}

/*
Также у функции main есть вариация с поддержкой параметров командной строки
int main(int argc, char *argv[])
argc - количество переданных аргументов
argv - массив переданных аргументов
*/
