#include <stdio.h>

/*
ПРЕДИСЛОВИЕ
Я абсолютно ниху.. ничего не понимаю в работе с памятью указателями и прочим, да и с языками c/c++ знаком только теоретически из статей и рассказов
Всё что я знаю это как примерно программа выполняется на компьютере компилируется/интепретируется и как работает с памятью кучей/стэком и.т.п
Очень полезное видео по указателям: https://www.youtube.com/watch?v=nIY1fBkGQq4
*/

int main(void) {
    int number = 8;

    // Определяем указатель
    int *pointer;
    // Присваиваем указателю адрес памяти переменной number (операция присваивания, & возвращает адрес памяти)
    pointer = &number;
    // Также pointer можно инициализировать сразу с адресом переменной int *pointer = &number

    // Указатель может указывать на NULL, если нам не нужен какой-то конкретный адрес.
    int *nullPointer = NULL;

    // Выводим адрес памяти лежащий в указателе
    printf("Number address: %p\n", pointer);
    // printf при выводе адреса из указателя ожидает тип void, поэтому лучше явно привести указатель к void
    printf("Number address: %p \n", (void *)pointer);

    // Сам указатель также имеет адрес памяти и мы можем его получить
    printf("Pointer adddress: %p\n", &pointer);

    // Получаем значение переменной через указатель *pointer - операция разыменования
    // Операция разыменования позволяет получить объект по адресу который хранится в указателе
    printf("Pointer value: %d\n", *pointer);

    // Меняем данные в number через указатель pointer и операцию разыменования
    *pointer = 100;
    printf("Number: %d\n", number);

    // Обычно указатель указывает на данные определённого типа (В самом начале у нас было int *pointer, потому что мы работали в нём с int number)
    // Также можно сделать указатель на void, и он сможет хранить в себе адрес любого типа
    char letter = 'q';
    void *voidPointer = &letter;

    // Также указатели можно преобразовывать в другие типы
    char a = 'a';
    char *aPointer = &a;
    int *intPointer = (int *)aPointer;

    // Указатель по сути своей обычная переменная, с ним доступны все действия что и с обычными переменными.
    // Единственное отличие которое делает указатель указателем - он хранит в себе не конкретное значение, а адрес памяти.

    // Также можно делать массив из указателей
    // Пример массива указателей void, такой массив может хранить адреса на данные любых типов
    void *data[10];

    int num  = 1;
    char chr = 'x';
    float pi = 3.14;

    data[0] = &num;
    data[1] = &chr;
    data[2] = &pi;

    // Берём адрес num из data, преобразуем void в int и разыменовываем указатель
    printf("Num: %d", *(int *)data[0]);

    return 0;
}
