/*
    Работа с препроцессором языка (а также немножко про саму компиляцию программ на C)

    1. Препроцессор обрабатывает код программы до того как она будет скомпилирована, он обрабатывает директивы.
    2. После обработки препроцессора код компилируется в объектные файлы.
    3. После линковщик собирает объектные файлы в исполняемый файл или файл библиотеки.

    (Препроцессор -> Компиляция -> Линковка) -> исполняемый файл/файл библиотеки.
    Каждый из этапов можно (нужно) разобрать более подробно.
 */

// Директива #include позволяет включить текст из заголовочного файла
#include <stdio.h> // Также можно использовать "stdio.h"

// Директива #define позволяет определить макрос (идентификатор последовательность_символов)
#define X 15;
// Макросы также позволяют заменять целые выражения
#define HELLO_WORLD printf("Hello World!\n");
// Макрос также можно определить с аргументами (идентификатор(аргументы) последовательность_символов)
#define PRINT_TEXT(text) printf("Text: %s", text)

int main() {
    // Используем ранее созданный макрос X
    int number = X; // Препроцессор подставит число 15 вместо X
    printf("macros number: %d\n", number);

    // Используем макрос HELLO_WORLD
    HELLO_WORLD;

    // Используем макрос PRINT_TEXT с аргументом
    char text[] = "hi!";
    PRINT_TEXT(text);

    return 0;
}
